#include<iostream>
using namespace std;

//создание структуры:
struct Point
{
	//—труктура Point описывает точки на плоскости.
	double x;//координаты по x
	double y;//координаты по y
};
//создава€ структуру или класс мы создаЄм новый тип данных, а объ€вл€€ объекты этошо класса или структуры мы создаЄм переменные нашего типа

//        класс - это тип данных
//    структура - это тоже тип данных
//       объект - это сама€ обычна€ переменна€ 

void main()
{
	setlocale(LC_ALL, "Russian");
	Point A;  //ќбъ€вление объекта 'A' структуры 'Point'
	          //ќбъ€вление переменной 'A' типа 'Point'
}